In [ ]:
#import libaries

In [31]:
import pandas as pd
import numpy as np
import os

In [32]:
path = r'/Users/carolinazea/OneDrive/CareerFoundry/Achievement 4- Python/Instacart Basket Analysis'

In [33]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_conchecked.csv'), index_col = False)

In [34]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

## 1. If you haven’t performed the consistency checks covered in this Exercise on your df_prods dataframe, do so now

In [35]:
df_prods.describe()

         Unnamed: 0    product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000  49672.000000   49672.000000  49672.000000
mean   24852.005053  24850.349775     67.762442      11.728942      9.993282
std    14342.265579  14340.705287     38.315784       5.850779    453.615536
min        0.000000      1.000000      1.000000       1.000000      1.000000
25%    12432.750000  12432.750000     35.000000       7.000000      4.100000
50%    24851.500000  24850.500000     69.000000      13.000000      7.100000
75%    37272.250000  37268.250000    100.000000      17.000000     11.100000
max    49692.000000  49688.000000    134.000000      21.000000  99999.000000

## 2. Run the df.describe() function on your df_prods dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [ ]:
#    The max of product 'prices' is 99,999.00 where the mean is 9.99. This is far off from the max value. 
#    The minimum values for 'product_id, aisle_id, department_id, and prices' dataframe is 1, which makes sense 
#    An index column was created in the df_prods dataframe
#    There are no negative price numbers.

## 3. Check for mixed-type data in your df_ords dataframe

In [36]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [ ]:
#      Based on the function above, the 'if' condition wasn't met so the code was not executed

## 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type

In [ ]:
#      There were not mixed-type data in the 'df_ords' dataframe, but if there were I would implement 
#      turning the column from string to numeric, 
#      df_ords['column1'] = df_ords['column1'].astype('int64')

## 5. Run a check for missing values in your df_ords dataframe. In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [37]:
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [ ]:
#        there are 0 missing values in the 'df_ords' dataframe besides
#       'days_since_prior_order' column where it contains approximately  206,209 missing values

## 6. Address the missing values using an appropriate method. In a markdown cell, explain why you used your method of choice

In [38]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [39]:
df_ords_nan

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

In [ ]:
#    The output from the functiona above confirms there are missing values in the 'days_since_prior_order' column

In [ ]:
#    To address these missing values, we know these values are numeric so we would need to 
#    impute values with either the mean or median of the column. Since there is 206, 309 
#. dropping a column if more than 90 to 95 percent of its values are missing.

## Find mean and median for input

In [40]:
df_ords.median()

Unnamed: 0                1710541.0
order_id                  1710542.0
user_id                    102689.0
order_number                   11.0
orders_day_of_week              3.0
order_hour_of_day              13.0
days_since_prior_order          7.0
dtype: float64

In [41]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Imput mean values in 'days_since_prior_order'

In [42]:
df_ords['days_since_prior_order'] = df_ords['days_since_prior_order'].fillna((df_ords['days_since_prior_order'].mean()))

In [ ]:
# decided to use mean values for column, 'days_since_prior_order' since min and max values range from 0 to 3, 
# so picking the mean would be relatively close to those numbers

## Confirmed frequency check for values, all 0's which means no missing values

In [43]:
df_ords.isnull().sum()

Unnamed: 0                0
order_id                  0
user_id                   0
eval_set                  0
order_number              0
orders_day_of_week        0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

## 7. Run a check for duplicate values in your df_ords data. In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [44]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [45]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [ ]:
# There were no findings for duplicate values, I ran this in another notebook as well to double check, and I still 
# recieved the same output, which is nothing. 
# If  there were duplicate values, I would use the 'df_ords_dups = df_ords.drop_duplicates()''

## 8. Address the duplicates using an appropriate method. In a markdown cell, explain why you used your method of choice.

In [ ]:
# I figured I got this answer wrong since there were no duplicates found but I am not sure of my mistake

In [46]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,11.114836
1,1,2398795,1,prior,2,3,7,15.000000
2,2,473747,1,prior,3,3,12,21.000000
3,3,2254736,1,prior,4,4,7,29.000000
4,4,431534,1,prior,5,4,15,28.000000

In [47]:
df_ords.drop(columns = ['Unnamed: 0', 'eval_set'])

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,11.114836
1,2398795,1,2,3,7,15.000000
2,473747,1,3,3,12,21.000000
3,2254736,1,4,4,7,29.000000
4,431534,1,5,4,15,28.000000
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.000000
3421079,1854736,206209,11,4,10,30.000000
3421080,626363,206209,12,1,12,18.000000
3421081,2977660,206209,13,1,12,7.000000
3421082,272231,206209,14,6,14,30.000000

In [48]:
df_ords = df_ords.drop(columns = ['Unnamed: 0', 'eval_set'])

In [51]:
df_ords

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,11.114836
1,2398795,1,2,3,7,15.000000
2,473747,1,3,3,12,21.000000
3,2254736,1,4,4,7,29.000000
4,431534,1,5,4,15,28.000000
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.000000
3421079,1854736,206209,11,4,10,30.000000
3421080,626363,206209,12,1,12,18.000000
3421081,2977660,206209,13,1,12,7.000000
3421082,272231,206209,14,6,14,30.000000

## Deleting outliers: 'prices' > 100 
### This is from exercise 4.9

In [ ]:
sns.scatterplot(x = 'prices', y = 'prices',data = ords_prods_merge)

In [ ]:
pd.options.display.max_columns = None

In [ ]:
ords_prods_merge.loc[ords_prods_merge['prices'] > 100]

In [ ]:
ords_prods_merge.loc[ords_prods_merge['prices'] >100, 'prices'] = np.nan

In [ ]:
ords_prods_merge['prices'].max()

## 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [49]:
df_ords.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_consistencychecked.csv'))

In [50]:
df_prods.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_consistencychecked.csv'))

## 10. Save your Jupyter notebook and submit it here for your tutor to review.